In [1]:
import pandas as pd
from pandas import Series, DataFrame

import numpy as np

In [ ]:
for i in range(10):

In [2]:
data = DataFrame(np.arange(16).reshape((4,4)), index=['Ohio', 'Texas', "New York", 'Utah'],
                 columns=['one', 'two', 'three', 'four'])

In [3]:
data

          one  two  three  four
Ohio        0    1      2     3
Texas       4    5      6     7
New York    8    9     10    11
Utah       12   13     14    15

In [7]:
data.ix["TX"] = [9, 12, 12, 7]

In [8]:
data

          one  two  three  four
Ohio        0    1      2     3
Texas       4    5      6     7
New York    8    9     10    11
Utah       12   13     14    15
TX          9   12     12     7

In [11]:
data1 = DataFrame(columns=['one', 'two', 'three', 'four'])

In [12]:
data1

Empty DataFrame
Columns: [one, two, three, four]
Index: []

In [22]:
data1.ix[1] = [9, 12, 12, 7]

In [23]:
data1

    one   two  three  four
TX  9.0  12.0   12.0   7.0
0   9.0  12.0   12.0   7.0

In [24]:
ty = data.as_matrix()

In [25]:
ty

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [ 9, 12, 12,  7]])

In [26]:
ty = data.to_csv()

In [27]:
ty

',one,two,three,four\nOhio,0,1,2,3\nTexas,4,5,6,7\nNew York,8,9,10,11\nUtah,12,13,14,15\nTX,9,12,12,7\n'